#Missing Values

In [1]:
import numpy as np
import pandas as pd

In [2]:
#create a dataframe

df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[6,np.nan,np.nan],
                   'C':[1,2,3]})

df

     A    B  C
0  1.0  6.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.isna().sum()

A    1
B    2
C    0
dtype: int64

In [5]:
#removing the NaN values

df.dropna()

     A    B  C
0  1.0  6.0  1

In [6]:
df

     A    B  C
0  1.0  6.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.dropna(axis= 1)

   C
0  1
1  2
2  3

In [8]:
df.fillna(value = 'Mean or median or mode of data')

                                A                               B  C
0                               1                               6  1
1                               2  Mean or median or mode of data  2
2  Mean or median or mode of data  Mean or median or mode of data  3

In [9]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64